Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry Constructor (BendSurface)
 Initializes a new instance of the ConnectiveGeometry class for a stand-alone bend creation.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry(
	BendSurface bendSurface
)
Public Sub New (
	bendSurface As BendSurface
)
Parameters
bendSurface
Type: Tekla.Structures.Model.BendSurface
Conical or cylindrical surface geometry.
See Also
Reference
ConnectiveGeometry Class
ConnectiveGeometry Overload
Tekla.Structures.Model Namespace